eps0.3v1/backGround/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    overset
    {
        patchType       overset;
        type            zeroGradient;

        //type            overset;
	//value		$internalField;
    }

    wing
    {
        //type            uniformFixedValue;	//old
        //uniformValue    (0 0 0);		//old

        type            fixedValue;
        value		uniform (0 0 0);
    }

    "(inlet|outlet|topAndBottom)"
    {
        //type            uniformFixedValue;	//old
        //uniformValue    (0 0 0);		//old

        type            fixedValue;
        value		uniform (0 0 0);
    }

}

// ************************************************************************* //
